{
  "personal_details": {
    "name": "Anmol Chawla",
    "role": "Software Developer Engineer",
    "mobile": "+91 8619297007",
    "email": "chawlanmol@gmail.com",
    "location": "Banglore",
    "experience": [
      {
        "type": "Total Experience",
        "years": "4 years"
      }
    ],
    "linkedin": "anmol-chawla-2b4802101",
    "github": "chawlanmol"


  },
  "summary": {
    "title": "About me",
    "description": "I am a software engineer with 4+ years of experience in analysis, design, and development. I am passionate about creating efficient and high-quality software that meets the needs of clients and end-users. I am motivated, detail-oriented, and able to quickly learn new frameworks and concepts. I am dedicated to writing clean and maintainable code, which is crucial in delivering reliable and scalable software solutions"
  },
  "companyDetails": {
    "title": "Professional Experience",
    "companyList": [
      {
        "name": "PayPal",
        "role": "Software Engineer II",
        "years": "March 2021 - present",
        "expYears": "2 years",
        "description": [
          "Designed and developed open banking functionality in loan underwriting, enabling merchants to share financial information with consent. This information can be used at the time of loan underwriting for risk assessment associated with loan lending",
          "Re-architected and migrated loan application withdraw functionality, enabling merchants to withdraw loan applications on demand",
          "Implemented an automated KYB and KYC feature for merchants, which allowed for real-time KYB for businesses and real-time KYC for merchants applying for loans. This resulted in a significant reduction in the time and effort required to onboard new merchants, as well as a reduction in the risk of fraud",
          "Implemented unit tests using Mockito to ensure code coverage and identify potential bugs. I also implemented functional tests to verify the functionality of the application. In addition, I identified and implemented solutions for multiple production bugs. My work helped to improve the quality of the software and reduce the number of defects",
          "Designed and integrated with external APIs to get business and customer data from external services for features like open banking, automated KYB/KYC, etc. This improved the efficiency of data collection and processing, and reduced the risk of data breaches",
          "Took ownership of mentoring junior developers by providing guidance and support on technical topics, as well as career development. Actively participated in code reviews and design discussions, providing valuable feedback and insights. This helped to improve the quality of the software and the skills of the junior developers"
        ]
      },
      {
        "name": "OYO",
        "role": "Software Engineer",
        "years": "June 2019 - Nov 2020",
        "expYears": "1 year 5 months",
        "description": [
          "Design and development efforts for Ceil Discount feature to cap the overall discount. Worked on building high throughput asynchronous write service",
          "Built and deployed infrastructure for segmentation feature for discounting platform in order to optimise coupon discounting for larger set of users",
          "Design and development efforts for migration of existing coupon discounting system from a ROR based monolith to Java based micro-service with improved code and database design in order to achieve high performance in form of improved latency and stability of the system at a high\nrate of throughput (JAVA/RUBY)",
          "End to end integration of A/B service with discounting platform which resulted in significant increase of booking conversion (RUBY)",
          "Build a panel for coupon pre-application to automate the manual process which saved engineering bandwidth"
        ]
      },
      {
        "name": "OYO",
        "role": "Software Development Intern",
        "years": "Jan 2019 - Nov 2020",
        "expYears": "6 months",
        "description": [
          "Developed partial discounting capability in discounting platform for use cases such as micro stay bookings (RUBY)",
          "Developed and deployed front end panel for internal use cases such as coupon creation, coupon edit, pre applied coupons listing using React and Redux front end technologies"
        ]
      }
    ]
  },
  "key_projects": {
    "title": "Key Projects / Achievements",
    "description": [
      "Proposed and implemented new design changes for application withdraw functionality",
      "Received multiple bravos for collaboration, innovation across different initiatives",
      "Idea submission for paypal risk hackathon for loan Requester/Recommendation Engine"
    ]
  },
  "certificates": {
    "title": "Certificates and Awards",
    "description": [
      "Path breaker award for consistently exceeding the performance for the year 2021",
      "Path breaker award for providing optimized solution for a crucial bug",
      "Spot awards for multitasking and out-of-box thinking",
      "DataStructure and Algorithms in Zero To Mastery Academy"
    ]
  },
  "skillset": {
    "title": "Core Skills",
    "description": [
      "Java",
      "Spring Boot",
      "Data Structure",
      "Algorithm",
      "Postgresql",
      "Kafka",
      "Ruby",
      "RESTful API",
      "MySql",
      "AWS"
    ]
  },
  "methodology": {
    "title": "Methodology / Approach",
    "description": [
      "Microservice Architecture",
      "Agile methodology",
      "Test Driven Development",
      "Design Patterns",
      "RESTful Architecture"
    ]
  },
  "expertise": {
    "title": "Soft Skills",
    "description": [
      "Time management",
      "Analytical Thinking",
      "Problem Solving",
      "Decision making",
      "Teamwork",
      "Leadership",
      "Communication",
      "Troubleshooting"
    ]
  },
  "tools": {
    "title": "Tools",
    "description": [
      "Git",
      "GitHub",
      "Intellij",
      "Maven",
      "Mockito",
      "Postman",
      "Jira"
    ]
  },
  "education": {
    "title": "Education",
    "description": [
      {
        "institution": "Indian Institute of Information Technology Allahabad",
        "years": "2015 - 2019",
        "grade": "8.6 CGPA",
        "degree": "B.TECH",
        "specialization": "Electronics and Communication Engineering"
      },
      {
        "institution": "Good Shepherd Public School",
        "years": "2014",
        "grade": "94.60 %",
        "specialization": "SENIOR SECONDARY EXAMINATION CLASS XII"
      }
    ]
  }
}
